{
  "interpro_family": [
    "IPR000001",
    "IPR000014",
    "IPR000023",
    "IPR000031",
    "IPR000032",
    "IPR000043(Adenosylhomocysteinase-like)",
    "IPR000053(Thymidine/pyrimidine-nucleoside",
    "IPR000056(Ribulose-phosphate",
    "IPR000069",
    "IPR000070",
    "IPR000071",
    "IPR000073",
    "IPR000086",
    "IPR000089",
    "IPR000092(Polyprenyl",
    "IPR000101(Gamma-glutamyltranspeptidase)",
    "IPR000115(Phosphoribosylglycinamide",
    "IPR000120(Amidase)",
    "IPR000121",
    "IPR000123(RNA-directed",
    "IPR000146(Fructose-1,6-bisphosphatase",
    "IPR000150(Cof",
    "IPR000160",
    "IPR000172",
    "IPR000182",
    "IPR000183(Ornithine/DAP/Arg",
    "IPR000192",
    "IPR000194",
    "IPR000198",
    "IPR000200(Peptidase",
    "IPR000208",
    "IPR000209",
    "IPR000212(UvrD-like",
    "IPR000214",
    "IPR000217(Tubulin)",
    "IPR000239(GPCR",
    "IPR000242",
    "IPR000246(Peptidase",
    "IPR000253(Forkhead-associated",
    "IPR000254",
    "IPR000257",
    "IPR000260",
    "IPR000262",
    "IPR000269(Copper",
    "IPR000274(Adenylate",
    "IPR000277(Cys/Met",
    "IPR000286(Histone",
    "IPR000294",
    "IPR000300",
    "IPR000304(Pyrroline-5-carboxylate",
    "IPR000310",
    "IPR000312",
    "IPR000313",
    "IPR000322",
    "IPR000323",
    "IPR000326",
    "IPR000336(Flavivirus/Alphavirus",
    "IPR000340",
    "IPR000343(Glutamyl-tRNA",
    "IPR000352",
    "IPR000358(Ribonucleotide",
    "IPR000362(Fumarate",
    "IPR000367(G-protein",
    "IPR000368",
    "IPR000374(Phosphatidate",
    "IPR000375",
    "IPR000383",
    "IPR000387",
    "IPR000392(NifH/frxC",
    "IPR000396(Cyclic-AMP",
    "IPR000398(Thymidylate",
    "IPR000403",
    "IPR000404",
    "IPR000407(Nucleoside",
    "IPR000415(Nitroreductase-like)",
    "IPR000417(Hydroxyethylthiazole",
    "IPR000421",
    "IPR000422(3,4-dihydroxy-2-butanone",
    "IPR000436",
    "IPR000438(Acetyl-CoA",
    "IPR000447(FAD-dependent",
    "IPR000453(Chorismate",
    "IPR000477",
    "IPR000483",
    "IPR000487",
    "IPR000489",
    "IPR000490(Glycoside",
    "IPR000494",
    "IPR000504",
    "IPR000506",
    "IPR000510",
    "IPR000514(Glycoside",
    "IPR000515",
    "IPR000519",
    "IPR000523",
    "IPR000534",
    "IPR000542(Acyltransferase",
    "IPR000544(Octanoyltransferase)",
    "IPR000555",
    "IPR000559(Formate-tetrahydrofolate",
    "IPR000560(Histidine",
    "IPR000566",
    "IPR000572",
    "IPR000573",
    "IPR000577(Carbohydrate",
    "IPR000581",
    "IPR000582",
    "IPR000587",
    "IPR000595",
    "IPR000600(ROK",
    "IPR000602",
    "IPR000620",
    "IPR000623(Shikimate",
    "IPR000626",
    "IPR000627",
    "IPR000631(ATP/ADP-dependent",
    "IPR000639(Epoxide",
    "IPR000644",
    "IPR000649(Initiation",
    "IPR000652(Triosephosphate",
    "IPR000653(DegT/DnrJ/EryC1/StrS",
    "IPR000659(Pyridoxamine",
    "IPR000668",
    "IPR000669(Mannitol",
    "IPR000672(Tetrahydrofolate",
    "IPR000674",
    "IPR000675(Cutinase/acetylxylan",
    "IPR000682(Protein-L-isoaspartate(D-aspartate)",
    "IPR000683",
    "IPR000685",
    "IPR000705(Galactokinase)",
    "IPR000706(N-acetyl-gamma-glutamyl-phosphate",
    "IPR000713",
    "IPR000715(Glycosyl",
    "IPR000716",
    "IPR000718(Peptidase",
    "IPR000719",
    "IPR000720(Peptidylglycine",
    "IPR000726",
    "IPR000731",
    "IPR000734(Triacylglycerol",
    "IPR000738",
    "IPR000741(Fructose-bisphosphate",
    "IPR000742",
    "IPR000743(Glycoside",
    "IPR000749(ATP:guanido",
    "IPR000752",
    "IPR000755(D-alanyl-D-alanine",
    "IPR000756",
    "IPR000757",
    "IPR000760(Inositol",
    "IPR000763(Catalase-peroxidase",
    "IPR000764(Uridine",
    "IPR000768(NAD:arginine",
    "IPR000771(Fructose-bisphosphate",
    "IPR000772",
    "IPR000774",
    "IPR000794(Beta-ketoacyl",
    "IPR000795(Translational",
    "IPR000796(Aspartate/other",
    "IPR000800",
    "IPR000801(Esterase-like)",
    "IPR000807(Imidazoleglycerol-phosphate",
    "IPR000811(Glycosyl",
    "IPR000819",
    "IPR000821(Alanine",
    "IPR000823(Plant",
    "IPR000829(DAGK",
    "IPR000834",
    "IPR000836",
    "IPR000840",
    "IPR000843",
    "IPR000845",
    "IPR000846",
    "IPR000850(Adenylate",
    "IPR000852(Glycoside",
    "IPR000859",
    "IPR000860(Porphobilinogen",
    "IPR000863",
    "IPR000866",
    "IPR000868",
    "IPR000870(Homoserine",
    "IPR000871(Beta-lactamase,",
    "IPR000873",
    "IPR000883(Cytochrome",
    "IPR000887(KDPG/KHG",
    "IPR000888(dTDP-4-dehydrorhamnose",
    "IPR000889(Glutathione",
    "IPR000890(Aliphatic",
    "IPR000891",
    "IPR000896",
    "IPR000897",
    "IPR000898(Indoleamine",
    "IPR000903(Glycylpeptide",
    "IPR000907(Lipoxygenase)",
    "IPR000908(Acetylcholinesterase,",
    "IPR000909",
    "IPR000916",
    "IPR000917",
    "IPR000924(Glutamyl/glutaminyl-tRNA",
    "IPR000926(GTP",
    "IPR000933(Glycoside",
    "IPR000940(Methyltransferase,",
    "IPR000941(Enolase)",
    "IPR000945(Dopamine",
    "IPR000959",
    "IPR000960(Flavin",
    "IPR000961",
    "IPR000971",
    "IPR000979(Phosphodiesterase",
    "IPR000980",
    "IPR000994",
    "IPR000997(Cholinesterase)",
    "IPR000998",
    "IPR001002",
    "IPR001007",
    "IPR001015(Ferrochelatase)",
    "IPR001017",
    "IPR001019(Guanine",
    "IPR001024",
    "IPR001025",
    "IPR001030",
    "IPR001031",
    "IPR001037",
    "IPR001041",
    "IPR001045(Spermidine/spermine",
    "IPR001048",
    "IPR001054",
    "IPR001057(Glutamate/acetylglutamate",
    "IPR001067(Nuclear",
    "IPR001077",
    "IPR001078",
    "IPR001085(Serine",
    "IPR001086",
    "IPR001087(GDSL",
    "IPR001088(Glycoside",
    "IPR001091(Restriction/modification",
    "IPR001093",
    "IPR001094",
    "IPR001096(Peptidase",
    "IPR001098",
    "IPR001099",
    "IPR001100(Pyridine",
    "IPR001102",
    "IPR001106(Aromatic",
    "IPR001117",
    "IPR001122",
    "IPR001126",
    "IPR001128(Cytochrome",
    "IPR001129(Membrane-associated,",
    "IPR001139(Glycoside",
    "IPR001148",
    "IPR001150",
    "IPR001154(DNA",
    "IPR001155",
    "IPR001157",
    "IPR001161(Helicase",
    "IPR001173",
    "IPR001174(HddA/FKP)",
    "IPR001179",
    "IPR001180",
    "IPR001199",
    "IPR001205",
    "IPR001206",
    "IPR001212",
    "IPR001214",
    "IPR001223",
    "IPR001227(Acyl",
    "IPR001228(2-C-methyl-D-erythritol",
    "IPR001236",
    "IPR001240(N-",
    "IPR001241(DNA",
    "IPR001242",
    "IPR001245",
    "IPR001246(Lipoxygenase,",
    "IPR001250(Mannose-6-phosphate",
    "IPR001254",
    "IPR001260(Coproporphyrinogen",
    "IPR001263",
    "IPR001264",
    "IPR001267(Thymidine",
    "IPR001270(ClpA/B",
    "IPR001272(Phosphoenolpyruvate",
    "IPR001273(Aromatic",
    "IPR001278(Arginine-tRNA",
    "IPR001279",
    "IPR001282(Glucose-6-phosphate",
    "IPR001287(Nitrite",
    "IPR001296",
    "IPR001303",
    "IPR001309",
    "IPR001310(Histidine",
    "IPR001312(Hexokinase)",
    "IPR001314(Peptidase",
    "IPR001315",
    "IPR001330",
    "IPR001341(Aspartate",
    "IPR001342",
    "IPR001347",
    "IPR001348(ATP",
    "IPR001351",
    "IPR001357",
    "IPR001360(Glycoside",
    "IPR001362(Glycoside",
    "IPR001365",
    "IPR001375",
    "IPR001381(3-dehydroquinate",
    "IPR001382(Glycoside",
    "IPR001387",
    "IPR001398(Macrophage",
    "IPR001401",
    "IPR001404(Heat",
    "IPR001424",
    "IPR001433",
    "IPR001441(Decaprenyl",
    "IPR001446(5-lipoxygenase-activating",
    "IPR001447(Arylamine",
    "IPR001452",
    "IPR001453",
    "IPR001460",
    "IPR001461(Aspartic",
    "IPR001465",
    "IPR001466",
    "IPR001474(GTP",
    "IPR001478",
    "IPR001487",
    "IPR001503(Glycosyl",
    "IPR001506",
    "IPR001509",
    "IPR001519(Ferritin)",
    "IPR001525(C-5",
    "IPR001528",
    "IPR001531",
    "IPR001533(Pterin",
    "IPR001538",
    "IPR001544(Aminotransferase",
    "IPR001547",
    "IPR001548(Peptidase",
    "IPR001557(L-lactate/malate",
    "IPR001559(Phosphotriesterase)",
    "IPR001564(Nucleoside",
    "IPR001566(23S",
    "IPR001568(Ribonuclease",
    "IPR001570",
    "IPR001576(Phosphoglycerate",
    "IPR001578",
    "IPR001584",
    "IPR001585(Transaldolase/Fructose-6-phosphate",
    "IPR001597",
    "IPR001604",
    "IPR001608",
    "IPR001613(Flavin",
    "IPR001621(Fungal",
    "IPR001633",
    "IPR001641",
    "IPR001645(Folylpolyglutamate",
    "IPR001650",
    "IPR001653(Diaminopimelate",
    "IPR001660",
    "IPR001661(Glycoside",
    "IPR001663(Aromatic-ring-hydroxylating",
    "IPR001667",
    "IPR001670",
    "IPR001672(Phosphoglucose",
    "IPR001674",
    "IPR001675(Glycosyl",
    "IPR001683",
    "IPR001690(Autoinducer",
    "IPR001695(Lysyl",
    "IPR001697(Pyruvate",
    "IPR001707(Chloramphenicol",
    "IPR001709",
    "IPR001714(Peptidase",
    "IPR001715",
    "IPR001721",
    "IPR001726(DNA",
    "IPR001731(Delta-aminolevulinic",
    "IPR001732",
    "IPR001736",
    "IPR001737(Ribosomal",
    "IPR001739",
    "IPR001750",
    "IPR001752",
    "IPR001753",
    "IPR001754",
    "IPR001757(P-type",
    "IPR001763",
    "IPR001764",
    "IPR001765(Carbonic",
    "IPR001769",
    "IPR001781",
    "IPR001783(Lumazine-binding",
    "IPR001788",
    "IPR001792",
    "IPR001796",
    "IPR001805(Adenosine",
    "IPR001828",
    "IPR001830(Glycosyl",
    "IPR001834(NADH:cytochrome",
    "IPR001841",
    "IPR001849",
    "IPR001850",
    "IPR001852(Pyridoxal",
    "IPR001853",
    "IPR001860(Glycoside",
    "IPR001864(Trypanothione",
    "IPR001874(Dehydroquinase,",
    "IPR001878",
    "IPR001881",
    "IPR001885(Lipoxygenase,",
    "IPR001889(Herpesvirus",
    "IPR001891(Malic",
    "IPR001906",
    "IPR001910",
    "IPR001920(Asp/Glu",
    "IPR001926",
    "IPR001929(Germin)",
    "IPR001930(Peptidase",
    "IPR001932",
    "IPR001937(Galactose-1-phosphate",
    "IPR001944(Glycoside",
    "IPR001945(RAD3/XPD)",
    "IPR001952(Alkaline",
    "IPR001962",
    "IPR001965",
    "IPR001977(Dephospho-CoA",
    "IPR001980(Phosphopantetheine",
    "IPR001985(S-adenosylmethionine",
    "IPR001986",
    "IPR001995",
    "IPR001998(Xylose",
    "IPR002008(DNA",
    "IPR002013",
    "IPR002016",
    "IPR002018",
    "IPR002019(Urease,",
    "IPR002020(Citrate",
    "IPR002024(Bacterioferritin)",
    "IPR002026(Urease,",
    "IPR002028(Tryptophan",
    "IPR002035",
    "IPR002042(Uricase)",
    "IPR002043(Uracil-DNA",
    "IPR002044",
    "IPR002048",
    "IPR002051(Haem",
    "IPR002054",
    "IPR002058",
    "IPR002060(Squalene/phytoene",
    "IPR002073",
    "IPR002079",
    "IPR002082(Aspartate",
    "IPR002083",
    "IPR002092(DNA-directed",
    "IPR002102",
    "IPR002103(Bacterial",
    "IPR002109",
    "IPR002115(Protein-tyrosine",
    "IPR002123",
    "IPR002125",
    "IPR002129",
    "IPR002130",
    "IPR002133(S-adenosylmethionine",
    "IPR002138",
    "IPR002139(Ribokinase/fructokinase)",
    "IPR002142",
    "IPR002155(Thiolase)",
    "IPR002156",
    "IPR002161(Pyridoxal",
    "IPR002166(RNA",
    "IPR002180(Lumazine/riboflavin",
    "IPR002192",
    "IPR002201(Glycosyl",
    "IPR002202(Hydroxymethylglutaryl-CoA",
    "IPR002205",
    "IPR002207(Class",
    "IPR002213(UDP-glucuronosyl/UDP-glucosyltransferase)",
    "IPR002219",
    "IPR002220(DapA-like)",
    "IPR002225",
    "IPR002227",
    "IPR002241(Glycoside",
    "IPR002252(Glycoside",
    "IPR002253(Flavin",
    "IPR002255(Flavin",
    "IPR002292(Ornithine/putrescine",
    "IPR002295(N4/N6-methyltransferase,",
    "IPR002298(DNA",
    "IPR002300",
    "IPR002301(Isoleucine-tRNA",
    "IPR002302(Leucine-tRNA",
    "IPR002303(Valine-tRNA",
    "IPR002305(Aminoacyl-tRNA",
    "IPR002306(Tryptophan-tRNA",
    "IPR002307(Tyrosine-tRNA",
    "IPR002312(Aspartyl/Asparaginyl-tRNA",
    "IPR002313(Lysine-tRNA",
    "IPR002314",
    "IPR002315(Glycyl-tRNA",
    "IPR002316(Proline-tRNA",
    "IPR002317(Serine-tRNA",
    "IPR002318(Alanine-tRNA",
    "IPR002320(Threonine-tRNA",
    "IPR002326(Cytochrome",
    "IPR002331(Pancreatic",
    "IPR002345(Lipocalin)",
    "IPR002346",
    "IPR002347(Short-chain",
    "IPR002372",
    "IPR002376",
    "IPR002397(Cytochrome",
    "IPR002398(Peptidase",
    "IPR002399(Cytochrome",
    "IPR002401(Cytochrome",
    "IPR002402(Cytochrome",
    "IPR002403(Cytochrome",
    "IPR002410(Peptidase",
    "IPR002421",
    "IPR002429",
    "IPR002433(Ornithine",
    "IPR002452(Alpha",
    "IPR002467(Peptidase",
    "IPR002469",
    "IPR002474",
    "IPR002480(DAHP",
    "IPR002489",
    "IPR002495(Glycosyl",
    "IPR002496",
    "IPR002498",
    "IPR002500",
    "IPR002504(NAD",
    "IPR002505",
    "IPR002509",
    "IPR002516(Glycosyl",
    "IPR002535",
    "IPR002539",
    "IPR002547",
    "IPR002562",
    "IPR002563",
    "IPR002569",
    "IPR002575",
    "IPR002579",
    "IPR002582(Holo-[acyl",
    "IPR002587(Myo-inositol-1-phosphate",
    "IPR002588",
    "IPR002589",
    "IPR002591(Type",
    "IPR002606(Riboflavin",
    "IPR002616(tRNA-guanine",
    "IPR002618(UDPGP",
    "IPR002620",
    "IPR002624(Deoxynucleoside",
    "IPR002629",
    "IPR002637(RdgB/HAM1)",
    "IPR002638",
    "IPR002640(Arylesterase)",
    "IPR002641",
    "IPR002646",
    "IPR002648(Adenylate",
    "IPR002649(tRNA",
    "IPR002650(Sulphate",
    "IPR002655",
    "IPR002659(Glycosyl",
    "IPR002678(DUF34/NIF3)",
    "IPR002680(Alternative",
    "IPR002684(Biotin",
    "IPR002692(Penicillin/GL-7-ACA/AHL/aculeacin-A",
    "IPR002695(Bifunctional",
    "IPR002698(5-formyltetrahydrofolate",
    "IPR002701",
    "IPR002724(Pyruvoyl-dependent",
    "IPR002726(CDP-archaeol",
    "IPR002731",
    "IPR002734",
    "IPR002747(S-adenosyl-l-methionine",
    "IPR002770",
    "IPR002772",
    "IPR002773(Deoxyhypusine",
    "IPR002786(Inosine/xanthosine",
    "IPR002792",
    "IPR002795(S-adenosylmethionine",
    "IPR002800(Chorismate",
    "IPR002803(Fructose-1,6-bisphosphatase,",
    "IPR002811",
    "IPR002812(3-dehydroquinate",
    "IPR002813(Arginine",
    "IPR002818",
    "IPR002820",
    "IPR002830(UbiD",
    "IPR002840",
    "IPR002857",
    "IPR002864",
    "IPR002869(Pyruvate-flavodoxin",
    "IPR002872",
    "IPR002877",
    "IPR002880",
    "IPR002884",
    "IPR002888",
    "IPR002891(APS",
    "IPR002893",
    "IPR002904(Lysine-tRNA",
    "IPR002908(Frataxin/CyaY)",
    "IPR002909",
    "IPR002912",
    "IPR002915(DeoC/FbaB/LacD",
    "IPR002921",
    "IPR002925",
    "IPR002931",
    "IPR002932",
    "IPR002933(Peptidase",
    "IPR002934",
    "IPR002935(Class",
    "IPR002937",
    "IPR002938",
    "IPR002941",
    "IPR002942",
    "IPR002949(Cytochrome",
    "IPR002985(Arginine",
    "IPR002986(Diaminopimelate",
    "IPR002999",
    "IPR003000(Sirtuin",
    "IPR003008",
    "IPR003010",
    "IPR003018",
    "IPR003033",
    "IPR003036",
    "IPR003080(Glutathione",
    "IPR003081(Glutathione",
    "IPR003082(Glutathione",
    "IPR003084(Class",
    "IPR003094(Fructose-2,6-bisphosphatase)",
    "IPR003097",
    "IPR003099",
    "IPR003115",
    "IPR003130",
    "IPR003135",
    "IPR003136(Cytidylate",
    "IPR003137",
    "IPR003141",
    "IPR003142",
    "IPR003143(Cytochrome",
    "IPR003146",
    "IPR003156",
    "IPR003159",
    "IPR003168(Nitrile",
    "IPR003170(UDP-N-acetylenolpyruvoylglucosamine",
    "IPR003171",
    "IPR003178(Methyl-coenzyme",
    "IPR003180(Methylpurine-DNA",
    "IPR003190(Aspartate",
    "IPR003193(ADP-ribosyl",
    "IPR003200(Nicotinate-nucleotide-dimethylbenzimidazole",
    "IPR003206",
    "IPR003251",
    "IPR003265",
    "IPR003308",
    "IPR003313",
    "IPR003318",
    "IPR003321(Cytochrome",
    "IPR003329(Acylneuraminate",
    "IPR003331",
    "IPR003333(Cyclopropane",
    "IPR003343",
    "IPR003347",
    "IPR003356",
    "IPR003361(Acetaldehyde",
    "IPR003374(ApbE-like",
    "IPR003378",
    "IPR003379",
    "IPR003382",
    "IPR003385(Glycoside",
    "IPR003406(Glycosyl",
    "IPR003414(Polyphosphate",
    "IPR003421",
    "IPR003427(Histidine",
    "IPR003430(Propane/methane/phenol/toluene",
    "IPR003437(Glycine",
    "IPR003439",
    "IPR003447(FemABX",
    "IPR003451(4-hydroxy-3-methylbut-2-enyl",
    "IPR003462(Ornithine",
    "IPR003469(Glycoside",
    "IPR003476(Glycoside",
    "IPR003500(Sugar-phosphate",
    "IPR003524(Phospho-N-acetylmuramoyl-pentapeptide",
    "IPR003526",
    "IPR003540",
    "IPR003546(Type",
    "IPR003560(2,3-dihydro-2,3-dihydroxybenzoate",
    "IPR003563(Oxidized",
    "IPR003564(Dihydroneopterin",
    "IPR003565(Bis(5'-nucleosyl)-tetraphosphatase)",
    "IPR003583",
    "IPR003586",
    "IPR003587",
    "IPR003593",
    "IPR003594",
    "IPR003595",
    "IPR003598",
    "IPR003599",
    "IPR003607",
    "IPR003609",
    "IPR003616",
    "IPR003660",
    "IPR003661",
    "IPR003664(Fatty",
    "IPR003667(NqrDE/RnfAE)",
    "IPR003669(Thymidylate",
    "IPR003672",
    "IPR003673(CoA-transferase",
    "IPR003679(Aminoglycoside",
    "IPR003680",
    "IPR003694(NAD(+)",
    "IPR003695",
    "IPR003696",
    "IPR003697(Nucleoside",
    "IPR003699(S-adenosylmethionine:tRNA",
    "IPR003700(Ketopantoate",
    "IPR003702",
    "IPR003703(Acyl-CoA",
    "IPR003709",
    "IPR003710(Ketopantoate",
    "IPR003720(tRNA",
    "IPR003721(Pantoate-beta-alanine",
    "IPR003722",
    "IPR003724(ATP:cob(I)alamin",
    "IPR003726",
    "IPR003730(Multi-copper",
    "IPR003736",
    "IPR003737(N-acetylglucosaminyl",
    "IPR003739(Lysine-2,3-aminomutase/glutamate",
    "IPR003742(RNA",
    "IPR003754",
    "IPR003758(Tetraacyldisaccharide",
    "IPR003759(Cobalamin",
    "IPR003762(L-arabinose",
    "IPR003764(N-acetylglucosamine-6-phosphate",
    "IPR003766(Uronate",
    "IPR003767(Malate/L-lactate",
    "IPR003773(Menaquinone",
    "IPR003776",
    "IPR003778",
    "IPR003779",
    "IPR003781",
    "IPR003801(GTP",
    "IPR003806",
    "IPR003815(S-ribosylhomocysteinase",
    "IPR003819",
    "IPR003821(1-deoxy-D-xylulose",
    "IPR003824(Undecaprenyl-diphosphatase",
    "IPR003826(S-adenosylmethionine",
    "IPR003830((2R)-phospho-3-sulpholactate",
    "IPR003833",
    "IPR003836(Glucokinase)",
    "IPR003856",
    "IPR003859(Beta-1,4-galactosyltransferase)",
    "IPR003869",
    "IPR003876(Arginine",
    "IPR003918(NADH:ubiquinone",
    "IPR003919(Cellulose",
    "IPR003920(Cellulose",
    "IPR003953",
    "IPR003959",
    "IPR003961",
    "IPR003966(Prothrombin/thrombin)",
    "IPR003995(RTX",
    "IPR004006",
    "IPR004007",
    "IPR004013",
    "IPR004014",
    "IPR004030",
    "IPR004033(UbiE/COQ5",
    "IPR004042",
    "IPR004044",
    "IPR004045",
    "IPR004046",
    "IPR004095",
    "IPR004097",
    "IPR004099",
    "IPR004100",
    "IPR004101",
    "IPR004104",
    "IPR004113",
    "IPR004114",
    "IPR004115(GAD-like",
    "IPR004134(Peptidase",
    "IPR004136",
    "IPR004137(Hydroxylamine",
    "IPR004143",
    "IPR004154",
    "IPR004160",
    "IPR004161",
    "IPR004165(Coenzyme",
    "IPR004166",
    "IPR004167",
    "IPR004176",
    "IPR004182",
    "IPR004183",
    "IPR004184",
    "IPR004199",
    "IPR004215",
    "IPR004216(L-fucose/L-arabinose",
    "IPR004218",
    "IPR004223",
    "IPR004227",
    "IPR004229(Methylamine",
    "IPR004232",
    "IPR004235(Scytalone",
    "IPR004255",
    "IPR004265(Dirigent",
    "IPR004274",
    "IPR004276",
    "IPR004294(Carotenoid",
    "IPR004298(Nicotianamine",
    "IPR004303(Protein-arginine",
    "IPR004304(Acetamidase/Formamidase)",
    "IPR004305",
    "IPR004308(Glutamate-cysteine",
    "IPR004313(Acireductone",
    "IPR004352",
    "IPR004358",
    "IPR004360",
    "IPR004361(Glyoxalase",
    "IPR004363(Methylglyoxal",
    "IPR004364",
    "IPR004365",
    "IPR004372(Acetate/propionate",
    "IPR004379(UDP-galactopyranose",
    "IPR004380(Aspartate",
    "IPR004381(Glycerate",
    "IPR004385(Nucleoside",
    "IPR004390(Signal-recognition",
    "IPR004391(Glutamate",
    "IPR004393(Nicotinate-nucleotide",
    "IPR004399",
    "IPR004402(Purine",
    "IPR004404(Dihydroxy-acid",
    "IPR004408(Biotin--acetyl-CoA-carboxylase",
    "IPR004412(Glutamyl-tRNA(Gln)",
    "IPR004422(Beta-ribofuranosylphenol",
    "IPR004429(Isopropylmalate",
    "IPR004433(2-succinyl-5-enolpyruvyl-6-hydroxy-3-cyclohexene-1-carboxylic-acid",
    "IPR004434(Isocitrate",
    "IPR004436(Isocitrate",
    "IPR004439(Isocitrate",
    "IPR004443",
    "IPR004446(D,D-heptose",
    "IPR004450(Threonine",
    "IPR004456(2,3-bisphosphoglycerate-independent",
    "IPR004461(CO",
    "IPR004463(UDP-3-O-acyl",
    "IPR004464(Fructose-1,6-bisphosphatase",
    "IPR004467",
    "IPR004468(CTP",
    "IPR004472(Dethiobiotin",
    "IPR004480(Monothiol",
    "IPR004489(Succinate",
    "IPR004493(Leucyl-tRNA",
    "IPR004495",
    "IPR004499(Proline-tRNA",
    "IPR004500(Prolyl-tRNA",
    "IPR004503(Serine-tRNA",
    "IPR004508(Thioredoxin-independent",
    "IPR004511(Phosphoadenosine",
    "IPR004512(Ribosomal",
    "IPR004514(Glutamine-tRNA",
    "IPR004515(Phosphoheptose",
    "IPR004518",
    "IPR004523(Aspartate-tRNA",
    "IPR004524(Aspartate-tRNA",
    "IPR004526(Glutamyl-tRNA",
    "IPR004527(Glutamate-tRNA",
    "IPR004528(3-deoxy-D-manno-octulosonate",
    "IPR004534(L-seryl-tRNA(Sec)",
    "IPR004536(Selenophosphate",
    "IPR004541(Translation",
    "IPR004546(Restriction",
    "IPR004547(Glucosamine-6-phosphate",
    "IPR004549(Acetyl-CoA",
    "IPR004550(L-asparaginase,",
    "IPR004552",
    "IPR004553(Hydroxymethylglutaryl-CoA",
    "IPR004554(Hydroxymethylglutaryl-CoA",
    "IPR004558(Oxygen-independent",
    "IPR004561(Isochorismate",
    "IPR004562(Lipoyltransferase/lipoate-protein",
    "IPR004566(Pantothenate",
    "IPR004567(Type",
    "IPR004568",
    "IPR004572(Protoporphyrinogen",
    "IPR004574(Alkylated",
    "IPR004577(8-oxoguanine",
    "IPR004607(Phosphoribosylglycinamide",
    "IPR004614",
    "IPR004616(Leucyl/phenylalanyl-tRNA-protein",
    "IPR004617(Bis(5'-nucleosyl)-tetraphosphatase,",
    "IPR004618(Aspartate--ammonia",
    "IPR004619(Type",
    "IPR004620(5,10-methylenetetrahydrofolate",
    "IPR004621",
    "IPR004625(Pyridoxine",
    "IPR004627(L-threonine",
    "IPR004628(Mannonate",
    "IPR004629(Glycosyl",
    "IPR004631(4-aminobutyrate",
    "IPR004632(4-aminobutyrate",
    "IPR004635",
    "IPR004636(Acetylornithine/Succinylornithine",
    "IPR004637(2,4-diaminobutyrate",
    "IPR004639(Tetrapyrrole",
    "IPR004642(Serine",
    "IPR004644(Iron-sulphur-dependent",
    "IPR004646",
    "IPR004647",
    "IPR004651(Histidine",
    "IPR004654(Glucokinase",
    "IPR004655(Beta-ketoacyl-[acyl-carrier-protein]",
    "IPR004660(Pyruvate",
    "IPR004661(L-ribulose-5-phosphate",
    "IPR004662(Acetylglutamate",
    "IPR004666(Ribosomal",
    "IPR004674(Alkylhydroperoxidase",
    "IPR004675",
    "IPR004701",
    "IPR004708(Aspartate",
    "IPR004721(Dihydroorotase",
    "IPR004722(Dihydroorotase)",
    "IPR004723(8-amino-7-oxononanoate",
    "IPR004730(Transaldolase",
    "IPR004731(Transaldolase",
    "IPR004733(Phosphoribosylformylglycinamidine",
    "IPR004739",
    "IPR004761(Spore",
    "IPR004769(Adenylosuccinate",
    "IPR004782(L-fucose",
    "IPR004784(Galactose-6-phosphate",
    "IPR004785(Ribose",
    "IPR004788(Ribose",
    "IPR004789(Acetolactate",
    "IPR004790(Isocitrate",
    "IPR004794(Riboflavin",
    "IPR004800(Phosphosugar",
    "IPR004803(tRNA-guanine",
    "IPR004805(Error-prone",
    "IPR004809(Glutamine",
    "IPR004811(RelA/SpoT",
    "IPR004816(Hydroxymethylglutaryl-CoA",
    "IPR004821",
    "IPR004839",
    "IPR004843",
    "IPR004849(6-phosphogluconate",
    "IPR004852",
    "IPR004860",
    "IPR004861(Atypical",
    "IPR004887",
    "IPR004888(Glycoside",
    "IPR004889",
    "IPR004901(Reversibly",
    "IPR004925(HpaB/PvcC/4-BUDH)",
    "IPR004927(Alkylmercury",
    "IPR004948(Nucleoside-triphosphatase,",
    "IPR004960(Bacterial",
    "IPR004971(mRNA",
    "IPR004981(Tryptophan",
    "IPR004993(GH3",
    "IPR004995(Bacillus/Clostridium",
    "IPR005000",
    "IPR005002(Phosphomannomutase)",
    "IPR005018",
    "IPR005025",
    "IPR005066",
    "IPR005067(Fatty",
    "IPR005076(Glycosyl",
    "IPR005084",
    "IPR005085",
    "IPR005097",
    "IPR005106",
    "IPR005107",
    "IPR005110",
    "IPR005111",
    "IPR005117",
    "IPR005122",
    "IPR005123",
    "IPR005128(Alpha-acetolactate",
    "IPR005129(SIMIBI",
    "IPR005130",
    "IPR005131",
    "IPR005135",
    "IPR005144",
    "IPR005148",
    "IPR005150",
    "IPR005152(Lipase,",
    "IPR005165",
    "IPR005181",
    "IPR005194",
    "IPR005195",
    "IPR005196",
    "IPR005199(Glycoside",
    "IPR005201",
    "IPR005203",
    "IPR005215(Trigger",
    "IPR005225",
    "IPR005245(Conserved",
    "IPR005248(Nicotinate/nicotinamide",
    "IPR005249(Ap4A",
    "IPR005250(Ribose-1,5-bisphosphate",
    "IPR005251(Methylthioribose-1-phosphate",
    "IPR005252(Coenzyme",
    "IPR005255(PdxA",
    "IPR005256(Anthranilate",
    "IPR005257(Anthranilate",
    "IPR005260(Aspartate",
    "IPR005263(4-hydroxy-tetrahydrodipicolinate",
    "IPR005264(N-acetylneuraminate",
    "IPR005288(L-aspartate",
    "IPR005299(SAM",
    "IPR005302",
    "IPR005303",
    "IPR005308",
    "IPR005338(Anhydro-N-acetylmuramic",
    "IPR005442(Glutathione",
    "IPR005467",
    "IPR005474",
    "IPR005475",
    "IPR005477(Deoxyxylulose-5-phosphate",
    "IPR005478(Transketolase,",
    "IPR005479",
    "IPR005480",
    "IPR005481",
    "IPR005482",
    "IPR005483",
    "IPR005488(N-acetylmuramic",
    "IPR005493(Ribonuclease",
    "IPR005494",
    "IPR005499(6-carboxyhexanoate--CoA",
    "IPR005509",
    "IPR005511(Senescence",
    "IPR005519(Acid",
    "IPR005522(Inositol",
    "IPR005532",
    "IPR005536",
    "IPR005546",
    "IPR005593(Xylulose",
    "IPR005615(Glutathione",
    "IPR005630",
    "IPR005645",
    "IPR005656(MmgE/PrpD)",
    "IPR005668(2-isopropylmalate",
    "IPR005671(2-isopropylmalate",
    "IPR005674(CocE/Serine",
    "IPR005676(Aspartate-semialdehyde",
    "IPR005677(Fumarate",
    "IPR005697(Homoserine",
    "IPR005702",
    "IPR005703(Small",
    "IPR005708(Homogentisate",
    "IPR005715(Glutamate",
    "IPR005719(Dihydroorotate",
    "IPR005720",
    "IPR005722(ATP",
    "IPR005730(Carboxynorspermidine",
    "IPR005750(UDP-N-acetylglucosamine",
    "IPR005751(ATP-dependent",
    "IPR005757(Murein",
    "IPR005758(UDP-N-acetylmuramate--L-alanine",
    "IPR005759(Endonuclease",
    "IPR005761(UDP-N-acetylmuramoylalanyl-D-glutamate-2,6-diaminopimelate",
    "IPR005762(UDP-N-acetylmuramoylalanine-D-glutamate",
    "IPR005763(L-fucose",
    "IPR005764(Adenine",
    "IPR005765(Uracil",
    "IPR005771(UTP--glucose-1-phosphate",
    "IPR005782(P-type",
    "IPR005785(Branched-chain",
    "IPR005786(Branched-chain",
    "IPR005787(Threonine",
    "IPR005793",
    "IPR005801(ADC",
    "IPR005802(Aminodeoxychorismate",
    "IPR005804",
    "IPR005811",
    "IPR005814(Aminotransferase",
    "IPR005815(Adenosylmethionine--8-amino-7-oxononanoate",
    "IPR005835",
    "IPR005841(Alpha-D-phosphohexomutase",
    "IPR005843",
    "IPR005844",
    "IPR005845",
    "IPR005846",
    "IPR005848(Urease,",
    "IPR005849",
    "IPR005850",
    "IPR005852(Phosphoglucomutase,",
    "IPR005854(Amidophosphoribosyltransferase)",
    "IPR005855(Glucosamine-fructose-6-phosphate",
    "IPR005856(Cysteine",
    "IPR005857(Cystathionine",
    "IPR005858(Cysteine",
    "IPR005859(Cysteine",
    "IPR005861(Histidinol-phosphate",
    "IPR005862(Formate-dependent",
    "IPR005875",
    "IPR005877",
    "IPR005881(Serine",
    "IPR005882(Bifunctional",
    "IPR005884(Fumarate",
    "IPR005886(UDP-glucose",
    "IPR005888(dTDP-glucose",
    "IPR005892(Glycine",
    "IPR005900",
    "IPR005904(Hypoxanthine",
    "IPR005905(D-alanine--D-alanine",
    "IPR005907(Glucose-1-phosphate",
    "IPR005913(dTDP-4-dehydrorhamnose",
    "IPR005917(Phosphomevalonate",
    "IPR005919(Higher",
    "IPR005921(Histidine",
    "IPR005922(Phenylalanine",
    "IPR005925(Agmatinase-related)",
    "IPR005927(Tagatose",
    "IPR005928(6-phospho-beta-galactosidase)",
    "IPR005929(Ribulokinase)",
    "IPR005930(Pyruvate",
    "IPR005931(Delta-1-pyrroline-5-carboxylate",
    "IPR005932(1-pyrroline-5-carboxylate",
    "IPR005933",
    "IPR005935(Diphosphomevalonate/phosphomevalonate",
    "IPR005940(Anthranilate",
    "IPR005941(Succinyl-diaminopimelate",
    "IPR005945(Proline-specific",
    "IPR005946(Ribose-phosphate",
    "IPR005949(Formate",
    "IPR005952(Phosphoglycerate",
    "IPR005954",
    "IPR005955(Glutathione",
    "IPR005956(4-hydroxyphenylpyruvate",
    "IPR005957(Tyrosine",
    "IPR005958(Tyrosine/nicotianamine",
    "IPR005959(Fumarylacetoacetase)",
    "IPR005960(Phenylalanine-4-hydroxylase,",
    "IPR005961(Phenylalanine-4-hydroxylase,",
    "IPR005962(Tyrosine",
    "IPR005963(Tryptophan",
    "IPR005965(1-aminocyclopropane-1-carboxylate",
    "IPR005966(D-cysteine",
    "IPR005977(Nitrogenase",
    "IPR005979(Protochlorophyllide",
    "IPR005982(Thioredoxin",
    "IPR005986(Aspartate-semialdehyde",
    "IPR005990(Inosine-5'-monophosphate",
    "IPR005993(GMP",
    "IPR005995(Phosphoglycerate",
    "IPR005999(Glycerol",
    "IPR006000(Xylulokinase)",
    "IPR006001(Carbohydrate",
    "IPR006004(Sulfide",
    "IPR006005(Glutamate",
    "IPR006006(Glutamate",
    "IPR006009(N-acetylglucosaminyltransferase,",
    "IPR006013(Antifreeze,",
    "IPR006026",
    "IPR006033(Type",
    "IPR006034(Asparaginase/glutaminase-like)",
    "IPR006035(Ureohydrolase)",
    "IPR006045",
    "IPR006046(Alpha",
    "IPR006047",
    "IPR006048",
    "IPR006054",
    "IPR006059(Bacterial-type",
    "IPR006062(Histidine",
    "IPR006063(HisA,",
    "IPR006067",
    "IPR006068",
    "IPR006073",
    "IPR006076",
    "IPR006083",
    "IPR006091",
    "IPR006094",
    "IPR006095(Glutamate/phenylalanine/leucine/valine/L-tryptophan",
    "IPR006096",
    "IPR006097",
    "IPR006098",
    "IPR006099",
    "IPR006101(Glycoside",
    "IPR006102",
    "IPR006103",
    "IPR006104",
    "IPR006108",
    "IPR006109",
    "IPR006113(6-phosphogluconate",
    "IPR006114",
    "IPR006115",
    "IPR006116",
    "IPR006121",
    "IPR006122",
    "IPR006124",
    "IPR006130(Aspartate/ornithine",
    "IPR006131",
    "IPR006132",
    "IPR006133",
    "IPR006134",
    "IPR006139",
    "IPR006140",
    "IPR006142",
    "IPR006148",
    "IPR006151",
    "IPR006156(Dihydroneopterin",
    "IPR006157",
    "IPR006158(Cobalamin",
    "IPR006159",
    "IPR006168(Glycerol-3-phosphate",
    "IPR006171",
    "IPR006172(DNA-directed",
    "IPR006176",
    "IPR006179(5'-Nucleotidase/apyrase)",
    "IPR006183(6-phosphogluconate",
    "IPR006190",
    "IPR006195",
    "IPR006204",
    "IPR006205(Mevalonate",
    "IPR006206(Mevalonate/galactokinase)",
    "IPR006211",
    "IPR006215(Glycoside",
    "IPR006218",
    "IPR006219(DAHP",
    "IPR006221",
    "IPR006222",
    "IPR006223(Glycine",
    "IPR006231(Malate:quinone-oxidoreductase)",
    "IPR006233(Cystathionine",
    "IPR006236(D-3-phosphoglycerate",
    "IPR006237(L-methionine",
    "IPR006238(Cystathionine",
    "IPR006240(3'(2'),5'-bisphosphate",
    "IPR006249(Aconitase/Iron-responsive",
    "IPR006252(Malate",
    "IPR006253(Malate",
    "IPR006254(Isocitrate",
    "IPR006256(Dihydrolipoamide",
    "IPR006258(Dihydrolipoamide",
    "IPR006259(Adenylate",
    "IPR006261(dGTP",
    "IPR006264(3-phosphoshikimate",
    "IPR006266(UMP-CMP",
    "IPR006267(Adenylate",
    "IPR006268",
    "IPR006269(3-deoxy-8-phosphooctulonate",
    "IPR006274(Carbamoyl-phosphate",
    "IPR006275(Carbamoyl-phosphate",
    "IPR006276(Cobalamin-independent",
    "IPR006282(Thiamin",
    "IPR006283(Thiamine-monophosphate",
    "IPR006284(Glutathione",
    "IPR006287(Protein/nucleic",
    "IPR006294(2',3'-cyclic-nucleotide",
    "IPR006308(DNA",
    "IPR006313(Deferrochelatase)",
    "IPR006314(Dyp-type",
    "IPR006315",
    "IPR006316(Tryptophan",
    "IPR006318",
    "IPR006319(Phosphoenolpyruvate",
    "IPR006322(Glutathione",
    "IPR006323(Phosphonoacetaldehyde",
    "IPR006324(Glutathione",
    "IPR006328(L-2-Haloacid",
    "IPR006330(Adenosine/adenine",
    "IPR006331(Adenosine",
    "IPR006334(Glutamate--cysteine",
    "IPR006335(Glutathione",
    "IPR006336(Glutamate--cysteine",
    "IPR006338(Thioredoxin/glutathione",
    "IPR006349(2-phosphoglycolate",
    "IPR006352(Phosphoglucosamine",
    "IPR006357(HAD-superfamily",
    "IPR006361(Uroporphyrinogen",
    "IPR006368(GDP-mannose",
    "IPR006375(Mannose-1-phosphate",
    "IPR006376(Copper-resistance",
    "IPR006379(HAD-superfamily",
    "IPR006380",
    "IPR006384(HAD",
    "IPR006390",
    "IPR006393(Sepiapterin",
    "IPR006394(Glutamate",
    "IPR006395(Methylaspartate",
    "IPR006396(Glutamate",
    "IPR006397(Glyoxylate",
    "IPR006400(Squalene",
    "IPR006405(Nicotinate",
    "IPR006409(Glycerol-3-phosphate",
    "IPR006411(Fructose-bisphosphate",
    "IPR006412(Fructose-bisphosphate",
    "IPR006415(P-type",
    "IPR006417",
    "IPR006418(Nicotinamide-nucleotide",
    "IPR006422(D-erythrose-4-phosphate",
    "IPR006423(5-nucleotidase",
    "IPR006424(Glyceraldehyde-3-phosphate",
    "IPR006426(Asparagine",
    "IPR006434(Pyrimidine",
    "IPR006439(HAD",
    "IPR006449(Squalene",
    "IPR006464(N-acetyltransferase",
    "IPR006468(Nitrate",
    "IPR006472(Citrate",
    "IPR006534(P-type",
    "IPR006543",
    "IPR006545",
    "IPR006549",
    "IPR006550(Bifunctional",
    "IPR006551",
    "IPR006554",
    "IPR006555",
    "IPR006560",
    "IPR006584",
    "IPR006620",
    "IPR006630",
    "IPR006638",
    "IPR006654(Tryptophan",
    "IPR006656",
    "IPR006657",
    "IPR006658(Molybdopterin",
    "IPR006659(Arsenate",
    "IPR006660(Arsenate",
    "IPR006674",
    "IPR006675",
    "IPR006679(Adenine",
    "IPR006680",
    "IPR006683",
    "IPR006684(Acyl-CoA",
    "IPR006700(Ribosomal",
    "IPR006710(Glycoside",
    "IPR006765(Polyketide",
    "IPR006775",
    "IPR006805",
    "IPR006823(Neutral/alkaline",
    "IPR006840(Glutathione-specific",
    "IPR006855",
    "IPR006905(Flavin-dependent",
    "IPR006935",
    "IPR006947",
    "IPR006948",
    "IPR006963",
    "IPR006982",
    "IPR007010(Poly",
    "IPR007012(Poly",
    "IPR007035(Peptidase",
    "IPR007036",
    "IPR007044",
    "IPR007052",
    "IPR007053",
    "IPR007085",
    "IPR007094",
    "IPR007110",
    "IPR007115(6-pyruvoyl",
    "IPR007138",
    "IPR007164(GTP-dependent",
    "IPR007173",
    "IPR007181",
    "IPR007184(Mannoside",
    "IPR007197",
    "IPR007214",
    "IPR007229(Nicotinate",
    "IPR007235",
    "IPR007266(Endoplasmic",
    "IPR007269(Isoprenylcysteine",
    "IPR007280",
    "IPR007295",
    "IPR007301",
    "IPR007310",
    "IPR007312(Phosphoesterase)",
    "IPR007325(Kynurenine",
    "IPR007329",
    "IPR007330",
    "IPR007342(Pseudouridine-5'-phosphate",
    "IPR007365",
    "IPR007370",
    "IPR007371",
    "IPR007373",
    "IPR007374",
    "IPR007392",
    "IPR007400(PrpF-like)",
    "IPR007419",
    "IPR007440(Chorismate--pyruvate",
    "IPR007453(Sulphur",
    "IPR007466(Peptidyl-arginine",
    "IPR007484",
    "IPR007505(PD-(D/E)XK",
    "IPR007506",
    "IPR007508(D-aminoacyl-tRNA",
    "IPR007516",
    "IPR007521",
    "IPR007525",
    "IPR007526",
    "IPR007535",
    "IPR007554(CDP-glycerol",
    "IPR007565((5-formylfuran-3-yl)methyl",
    "IPR007638",
    "IPR007639",
    "IPR007654",
    "IPR007657(Glycosyltransferase",
    "IPR007666(ADP-specific",
    "IPR007685",
    "IPR007686",
    "IPR007691(UDP-3-O-[3-hydroxymyristoyl]",
    "IPR007698",
    "IPR007702(Janus)",
    "IPR007721(D-ribose",
    "IPR007728",
    "IPR007754(N-acetylglucosaminyltransferase",
    "IPR007757(MT-A70-like)",
    "IPR007760(Manganese",
    "IPR007782(Vitamin",
    "IPR007788(Glutaminyl-peptide",
    "IPR007803",
    "IPR007807",
    "IPR007822(Lanthionine",
    "IPR007828(Inositol",
    "IPR007835",
    "IPR007839(GTP",
    "IPR007848",
    "IPR007857(Protein",
    "IPR007859",
    "IPR007862",
    "IPR007865",
    "IPR007867",
    "IPR007886",
    "IPR007894",
    "IPR007905(Emopamil-binding",
    "IPR007921",
    "IPR007943",
    "IPR007956",
    "IPR007965",
    "IPR008030",
    "IPR008035",
    "IPR008066(Cytochrome",
    "IPR008067(Cytochrome",
    "IPR008068(Cytochrome",
    "IPR008069(Cytochrome",
    "IPR008072(Cytochrome",
    "IPR008104(Macrophage",
    "IPR008135(Competence-induced",
    "IPR008136",
    "IPR008141(Alanine",
    "IPR008144",
    "IPR008145",
    "IPR008146",
    "IPR008147",
    "IPR008162(Inorganic",
    "IPR008179(Phosphoribosyl-ATP",
    "IPR008181(Deoxyuridine",
    "IPR008183(Aldose",
    "IPR008209(Phosphoenolpyruvate",
    "IPR008210(Phosphoenolpyruvate",
    "IPR008213",
    "IPR008219(Proline",
    "IPR008220(Homoserine/serine",
    "IPR008221(Urease)",
    "IPR008229(tRNA",
    "IPR008238(Chorismate",
    "IPR008240(Chorismate",
    "IPR008241(Salicylate",
    "IPR008242(Bifunctional",
    "IPR008243(Chorismate",
    "IPR008244(Bifunctional",
    "IPR008250(P-type",
    "IPR008254",
    "IPR008264(Beta-glucanase)",
    "IPR008274",
    "IPR008278",
    "IPR008279",
    "IPR008280(Tubulin/FtsZ,",
    "IPR008283",
    "IPR008286",
    "IPR008289(Pentafunctional",
    "IPR008294(Meprin",
    "IPR008300(Phosphate",
    "IPR008314(N(4)-acetylcytidine",
    "IPR008330(Peptidase",
    "IPR008331",
    "IPR008332",
    "IPR008333",
    "IPR008334",
    "IPR008335(Eukaryotic",
    "IPR008343(Mitogen-activated",
    "IPR008352(Mitogen-activated",
    "IPR008363(Paraoxonase1)",
    "IPR008391",
    "IPR008431(Cyclic",
    "IPR008434(Magnesium-protoporphyrin",
    "IPR008475",
    "IPR008576(Alpha-N-methyltransferase",
    "IPR008594(Scavenger",
    "IPR008731",
    "IPR008740",
    "IPR008753",
    "IPR008775(Phytanoyl-CoA",
    "IPR008794(Proline",
    "IPR008844(Spore",
    "IPR008880",
    "IPR008881",
    "IPR008884(Macrocin-O-methyltransferase)",
    "IPR008894",
    "IPR008902",
    "IPR008909",
    "IPR008916(Retrovirus",
    "IPR008919(Retrovirus",
    "IPR008922(Di-copper",
    "IPR008925(Aminoacyl-tRNA",
    "IPR008927(6-phosphogluconate",
    "IPR008928(Six-hairpin",
    "IPR008929(Chondroitin",
    "IPR008930(Terpenoid",
    "IPR008936(Rho",
    "IPR008947(Phospholipase",
    "IPR008948(L-Aspartase-like)",
    "IPR008949(Isoprenoid",
    "IPR008958",
    "IPR008963(Purple",
    "IPR008964(Invasin/intimin",
    "IPR008965(CBM2/CBM3,",
    "IPR008969(Carboxypeptidase-like,",
    "IPR008972(Cupredoxin)",
    "IPR008974(TRAF-like)",
    "IPR008977(PHM/PNGase",
    "IPR008978(HSP20-like",
    "IPR008979(Galactose-binding-like",
    "IPR008984(SMAD/FHA",
    "IPR008988(Transcriptional",
    "IPR008990(Electron",
    "IPR008995(Molybdate/tungstate",
    "IPR009000(Translation",
    "IPR009001(Translation",
    "IPR009003(Peptidase",
    "IPR009006(Alanine",
    "IPR009008(Valyl/Leucyl/Isoleucyl-tRNA",
    "IPR009010(Aspartate",
    "IPR009014(Transketolase",
    "IPR009015(L-fucose",
    "IPR009019(K",
    "IPR009023(Hydroxymethylglutaryl-CoA",
    "IPR009024(Methyl-coenzyme",
    "IPR009029(Hydroxymethylglutaryl-CoA",
    "IPR009030(Growth",
    "IPR009040",
    "IPR009045(Peptidase",
    "IPR009049(Argininosuccinate",
    "IPR009050(Globin-like",
    "IPR009051(Alpha-helical",
    "IPR009056",
    "IPR009057(Homedomain-like",
    "IPR009068(uS15/NS1,",
    "IPR009071",
    "IPR009075",
    "IPR009078(Ferritin-like",
    "IPR009080(Aminoacyl-tRNA",
    "IPR009081",
    "IPR009097(Cyclic",
    "IPR009100(Acyl-CoA",
    "IPR009158(Glycerol-3-phosphate",
    "IPR009161(ATP-dependent",
    "IPR009163(Ap4A",
    "IPR009246(Ethanolamine",
    "IPR009286(Inositol-pentakisphosphate",
    "IPR009308(Rhamnose",
    "IPR009453(IMP-specific",
    "IPR009461",
    "IPR009466",
    "IPR009469",
    "IPR009581",
    "IPR009721",
    "IPR009770(2-oxoadipate",
    "IPR009875",
    "IPR009880",
    "IPR009906",
    "IPR009915",
    "IPR009953(Dinitrogenase",
    "IPR010023(KdsC",
    "IPR010025(HAD-superfamily",
    "IPR010029(Galactonolactone",
    "IPR010030(L-gulonolactone",
    "IPR010031(L-gulonolactone/D-arabinono-1,4-lactone",
    "IPR010043(Bifunctional",
    "IPR010044(Methylthioadenosine",
    "IPR010045(Phosphopentomutase)",
    "IPR010047(Ni-containing",
    "IPR010049(MTA/SAH",
    "IPR010051(Periplasmic",
    "IPR010058(Uridine",
    "IPR010059(Uridine",
    "IPR010061(Methylmalonate-semialdehyde",
    "IPR010062(5,10-methenyltetrahydromethanopterin",
    "IPR010071",
    "IPR010072(D-alanine--D-alanyl",
    "IPR010073(Phosphoribosylformylglycinamidine",
    "IPR010076(Pimeloyl-[acyl-carrier",
    "IPR010079(Xanthine",
    "IPR010080",
    "IPR010081(Diaminopropionate",
    "IPR010089(Flavoprotein",
    "IPR010097(Malate",
    "IPR010098(Glycyl",
    "IPR010102(Succinate",
    "IPR010107(Glutamate",
    "IPR010109(Citrate",
    "IPR010110",
    "IPR010111(Kynureninase)",
    "IPR010116(Anthranilate",
    "IPR010117(Para-aminobenzoate",
    "IPR010121(Pyruvate,",
    "IPR010122(Hydroxymethylglutaryl-CoA",
    "IPR010123(Poly(R)-hydroxyalkanoic",
    "IPR010137(Acyl-[acyl-carrier-protein]--UDP-N-acetylglucosamine",
    "IPR010139(Imidazole",
    "IPR010140(Histidinol",
    "IPR010158(N-carbamoyl-L-amino-acid",
    "IPR010159(N-acyl-L-amino-acid",
    "IPR010164(Ornithine",
    "IPR010169(Acetylornithine",
    "IPR010174(Succinyl-diaminopimelate",
    "IPR010175([LysW]-lysine/[LysW]-ornithine",
    "IPR010185(NADPH-dependent",
    "IPR010188(HisA/PriA,",
    "IPR010189(Shikimate",
    "IPR010190(Diaminopimelate",
    "IPR010191(IMP",
    "IPR010192(2-succinylbenzoate--CoA",
    "IPR010194(Anti-sigma",
    "IPR010196(o-Succinylbenzoate",
    "IPR010197(o-Succinylbenzoate",
    "IPR010198(1,4-Dihydroxy-2-naphthoyl-CoA",
    "IPR010203(Regulator",
    "IPR010206(Poly(A)",
    "IPR010227(NADH-quinone",
    "IPR010240(Cysteine",
    "IPR010244(Chlorophyllide",
    "IPR010251(Magnesium-protoporphyrin",
    "IPR010252(Formimidoylglutamate",
    "IPR010254(B12-dependent",
    "IPR010255(Haem",
    "IPR010259",
    "IPR010262(Arylsulfotransferase,",
    "IPR010280((Uracil-5)-methyltransferase",
    "IPR010286(METTL16/RlmF",
    "IPR010300(Cysteine",
    "IPR010313(Glycine",
    "IPR010329(3-hydroxyanthranilic",
    "IPR010349(L-asparaginase",
    "IPR010354(Oleate",
    "IPR010357",
    "IPR010376",
    "IPR010383",
    "IPR010426(Trimethylamine",
    "IPR010451(Acetoacetate",
    "IPR010458(Trichodiene",
    "IPR010462(Ectoine",
    "IPR010468",
    "IPR010493",
    "IPR010497",
    "IPR010505",
    "IPR010506",
    "IPR010520(Esterase",
    "IPR010551",
    "IPR010566",
    "IPR010570(UpxZ",
    "IPR010582",
    "IPR010610",
    "IPR010614",
    "IPR010643",
    "IPR010644(Heme-dependent",
    "IPR010655",
    "IPR010659",
    "IPR010661",
    "IPR010663",
    "IPR010720",
    "IPR010722",
    "IPR010723",
    "IPR010737",
    "IPR010758(Trans-2-enoyl-CoA",
    "IPR010766",
    "IPR010791",
    "IPR010795",
    "IPR010819(N-acylglucosamine",
    "IPR010864(D-lyxose",
    "IPR010900",
    "IPR010905(Glycosyl",
    "IPR010918",
    "IPR010940",
    "IPR010941",
    "IPR010945(Malate",
    "IPR010950",
    "IPR010952",
    "IPR010953(Citrate",
    "IPR010954",
    "IPR010958",
    "IPR010960(Flavocytochrome",
    "IPR010961",
    "IPR010962(Putative",
    "IPR010963(Poly(R)-hydroxyalkanoic",
    "IPR010970(Cysteine",
    "IPR010972(Beta-phosphoglucomutase)",
    "IPR010976",
    "IPR010977(Aromatic-L-amino-acid",
    "IPR010978(Class",
    "IPR010979(Small",
    "IPR010982(Lambda",
    "IPR010985(Ribbon-helix-helix)",
    "IPR010987",
    "IPR010996",
    "IPR010999(Retroviral",
    "IPR011004(Trimeric",
    "IPR011005(Dihydropteroate",
    "IPR011006(CheY-like",
    "IPR011008(Dimeric",
    "IPR011009(Protein",
    "IPR011011(Zinc",
    "IPR011013(Galactose",
    "IPR011020",
    "IPR011025(G",
    "IPR011029(Death-like",
    "IPR011032(GroES-like",
    "IPR011034(Formyl",
    "IPR011035(Large",
    "IPR011037(Pyruvate",
    "IPR011040",
    "IPR011041(Soluble",
    "IPR011042(Six-bladed",
    "IPR011043(Galactose",
    "IPR011044(Quinoprotein",
    "IPR011045(Nitrous",
    "IPR011047(Quinoprotein",
    "IPR011048(Cytochrome",
    "IPR011049(Serralysin-like",
    "IPR011050(Pectin",
    "IPR011051(RmlC-like",
    "IPR011053(Single",
    "IPR011054(Rudiment",
    "IPR011057(Mss4-like",
    "IPR011059(Metal-dependent",
    "IPR011060(Ribulose-phosphate",
    "IPR011063(tRNA",
    "IPR011068(Nucleotidyltransferase,",
    "IPR011071(Polysaccharide",
    "IPR011072",
    "IPR011076(Malate",
    "IPR011079",
    "IPR011081",
    "IPR011095",
    "IPR011096",
    "IPR011098",
    "IPR011118(Tannase/feruloyl",
    "IPR011120",
    "IPR011127",
    "IPR011128",
    "IPR011141(Polyketide",
    "IPR011145(Scavenger",
    "IPR011146",
    "IPR011147",
    "IPR011150(Cutinase,",
    "IPR011166(Beta-eliminating",
    "IPR011167(Iron-dependent",
    "IPR011179(Isopentenyl-diphosphate",
    "IPR011182(L-aspartate",
    "IPR011183(Pyrophosphate-dependent",
    "IPR011192(Rubisco",
    "IPR011193(Ornithine/lysine/arginine",
    "IPR011206(Citrate",
    "IPR011234",
    "IPR011241(Bifunctional",
    "IPR011245(Butyrate",
    "IPR011249(Metalloenzyme,",
    "IPR011251",
    "IPR011254(Prismane-like",
    "IPR011257(DNA",
    "IPR011258",
    "IPR011264(Betaine",
    "IPR011268(Purine",
    "IPR011270(Purine",
    "IPR011273(Malate",
    "IPR011274(Malate",
    "IPR011275(Malate",
    "IPR011277",
    "IPR011278(2-methylcitrate",
    "IPR011281(Succinate",
    "IPR011282(2-amino-3-ketobutyrate",
    "IPR011284(3-oxoacyl-(acyl-carrier-protein)",
    "IPR011286(2-dehydro-3-deoxy-D-gluconate",
    "IPR011288(D-tagatose-bisphosphate",
    "IPR011289(Fructose-1,6-bisphosphate",
    "IPR011292(Na(+)-translocating",
    "IPR011294(3-hydroxybutyrate",
    "IPR011304(L-lactate",
    "IPR011322(Nitrogen",
    "IPR011324(Cytotoxic",
    "IPR011330(Glycoside",
    "IPR011334(UDP-3-O-acyl",
    "IPR011342(Shikimate",
    "IPR011343(Deoxyribose-phosphate",
    "IPR011348(17beta-dehydrogenase)",
    "IPR011356(Peptidase",
    "IPR011404(Pyrophosphate--fructose",
    "IPR011407(10-formyltetrahydrofolate",
    "IPR011492",
    "IPR011496",
    "IPR011527",
    "IPR011529(Glutamate",
    "IPR011534(Aspartate-semialdehyde",
    "IPR011545",
    "IPR011548(3-hydroxyisobutyrate",
    "IPR011549",
    "IPR011551(NTP",
    "IPR011556(Glutamate--cysteine",
    "IPR011559(Initiation",
    "IPR011576",
    "IPR011583",
    "IPR011598",
    "IPR011600",
    "IPR011601",
    "IPR011602(Type",
    "IPR011603(2-oxoglutarate",
    "IPR011607",
    "IPR011611",
    "IPR011612",
    "IPR011613",
    "IPR011614",
    "IPR011639",
    "IPR011644",
    "IPR011645",
    "IPR011650",
    "IPR011661(Sulphur",
    "IPR011682",
    "IPR011697(Peptidase",
    "IPR011698",
    "IPR011706",
    "IPR011707",
    "IPR011708",
    "IPR011761",
    "IPR011762",
    "IPR011763",
    "IPR011764",
    "IPR011766",
    "IPR011771(Magnesium-chelatase,",
    "IPR011776(Magnesium",
    "IPR011778(Hydantoinase/dihydropyrimidinase)",
    "IPR011780(D-serine",
    "IPR011786(Sulphite",
    "IPR011790(ADP-specific",
    "IPR011793(Putative",
    "IPR011798(Adenosine",
    "IPR011800(Phosphoadenosine",
    "IPR011809(Histidinol-phosphate",
    "IPR011814(Malonyl-[acyl-carrier",
    "IPR011820(L-threonine",
    "IPR011821(O-succinylhomoserine",
    "IPR011822(Cobalamin-dependent",
    "IPR011827(Hydrolyase",
    "IPR011828(Isopropylmalate/isohomocitrate",
    "IPR011829(Tartrate",
    "IPR011830",
    "IPR011831(Glucose-1-phosphate",
    "IPR011833(Glycogen/starch/alpha-glucan",
    "IPR011834(Alpha-glucan",
    "IPR011835(Bacterial/plant",
    "IPR011859(Dihydrodipicolinate",
    "IPR011860(Ribose",
    "IPR011870(Lysine",
    "IPR011872(Homocitrate",
    "IPR011875(Alpha-maltose-1-phosphate",
    "IPR011876(Isopentenyl-diphosphate",
    "IPR011877(Ribokinase)",
    "IPR011880(Phenylacetate-CoA",
    "IPR011887(Trimethylamine-N-oxide",
    "IPR011888(Anaerobic",
    "IPR011894",
    "IPR011899",
    "IPR011904(Acetate-CoA",
    "IPR011906",
    "IPR011908(Lipopolysaccharide",
    "IPR011916(Lipopolysaccharide",
    "IPR011920(Lipid",
    "IPR011944(Steroid",
    "IPR011945",
    "IPR011948",
    "IPR011957(Benzoate-CoA",
    "IPR011960(Gentisate",
    "IPR011963(2,3-dihydroxybenzoate-AMP",
    "IPR011966(Phenylacetic",
    "IPR011981(3,4-dihydroxyphenylacetate",
    "IPR011982(4-hydroxyphenylacetate",
    "IPR011989(Armadillo-like",
    "IPR011990(Tetratricopeptide-like",
    "IPR011992(EF-hand",
    "IPR011993(PH-like",
    "IPR011994",
    "IPR011995(Orotidine",
    "IPR011998",
    "IPR012000",
    "IPR012001",
    "IPR012003(ATP-dependent",
    "IPR012004(Pyrophosphate-dependent",
    "IPR012006(tRNA",
    "IPR012016(Phosphomevalonate",
    "IPR012019(FeGP",
    "IPR012028(Guanylylpyridinol",
    "IPR012042(Inorganic",
    "IPR012043(Pantoate",
    "IPR012047(Aconitase",
    "IPR012062(D-tagatose-1,6-bisphosphate",
    "IPR012070(Arogenate",
    "IPR012078(Methane/phenol",
    "IPR012079(Bifunctional",
    "IPR012080(Aspartate-semialdehyde",
    "IPR012094(tRNA(Ile)-lysidine",
    "IPR012101(Biotinidase-like,",
    "IPR012110(Pyruvate",
    "IPR012115(Bifunctional",
    "IPR012120(Fucose-1-phosphate",
    "IPR012131(Histidinol",
    "IPR012132(Glucose-methanol-choline",
    "IPR012133(Alpha-hydroxy",
    "IPR012135(Dihydroorotate",
    "IPR012137(Nitrate",
    "IPR012138(Hydroxylamine",
    "IPR012144(Nitric-oxide",
    "IPR012147(Phosphate",
    "IPR012148(Aromatic",
    "IPR012163(Sialyltransferase)",
    "IPR012171(Fatty",
    "IPR012175(Xanthine",
    "IPR012177(Thiamine",
    "IPR012183(Bifunctional",
    "IPR012188(NAD(P)-dependent",
    "IPR012189(Peptidase",
    "IPR012220(Glutamate",
    "IPR012224(Peptidase",
    "IPR012258(Acyl-CoA",
    "IPR012259(Dihydrofolate",
    "IPR012262(Bifunctional",
    "IPR012265(Protein-tyrosine",
    "IPR012280",
    "IPR012281(Phospholipid",
    "IPR012286",
    "IPR012292(Globin/Protoglobin)",
    "IPR012301",
    "IPR012302",
